## Production: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 1 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                           NAME                            |
|----------|-----------------------------------------------------------|
| update   | `aws_ssm_parameter.docdb_uri`                             |
| recreate | `aws_docdb_cluster.ai-answers-docdb-cluster`              |
|          | `aws_docdb_cluster_instance.ai-answers-docdb-instance[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_docdb_cluster.ai-answers-docdb-cluster must be replaced
-/+ resource "aws_docdb_cluster" "ai-answers-docdb-cluster" {
      ~ arn                             = "arn:aws:rds:ca-central-1:730335533085:cluster:ai-answers-docdb-cluster" -> (known after apply)
      ~ availability_zones              = [
          - "ca-central-1a",
          - "ca-central-1b",
          - "ca-central-1d",
        ] -> (known after apply)
      + cluster_identifier_prefix       = (known after apply)
      ~ cluster_members                 = [
          - "ai-answers-docdb-instance",
        ] -> (known after apply)
      ~ cluster_resource_id             = "cluster-7JPE3NTUVINQ5RPDZHCYNEBCGM" -> (known after apply)
      - deletion_protection             = false -> null
      - enabled_cloudwatch_logs_exports = [] -> null
      ~ endpoint                        = "ai-answers-docdb-cluster.cluster-czuu8ii2ypob.ca-central-1.docdb.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id                  = "Z13BE05W0CBKTH" -> (known after apply)
      ~ id                              = "ai-answers-docdb-cluster" -> (known after apply)
      ~ kms_key_id                      = "arn:aws:kms:ca-central-1:730335533085:key/e393e2aa-0ea4-4abb-aa52-6f54ce42e195" -> (known after apply)
      ~ master_password                 = (sensitive value)
      ~ master_username                 = (sensitive value) # forces replacement
      ~ preferred_backup_window         = "03:55-04:25" -> (known after apply)
      ~ preferred_maintenance_window    = "sun:08:38-sun:09:08" -> (known after apply)
      ~ reader_endpoint                 = "ai-answers-docdb-cluster.cluster-ro-czuu8ii2ypob.ca-central-1.docdb.amazonaws.com" -> (known after apply)
        tags                            = {
            "CostCentre" = "ai-answers-prod"
            "Terraform"  = "true"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_docdb_cluster_instance.ai-answers-docdb-instance[0] must be replaced
-/+ resource "aws_docdb_cluster_instance" "ai-answers-docdb-instance" {
      ~ arn                             = "arn:aws:rds:ca-central-1:730335533085:db:ai-answers-docdb-instance" -> (known after apply)
      ~ availability_zone               = "ca-central-1b" -> (known after apply)
      ~ ca_cert_identifier              = "rds-ca-rsa2048-g1" -> (known after apply)
      ~ cluster_identifier              = "ai-answers-docdb-cluster" -> (known after apply) # forces replacement
      - copy_tags_to_snapshot           = false -> null
      ~ db_subnet_group_name            = "ai-answers-example-docdb-subnet-group" -> (known after apply)
      ~ dbi_resource_id                 = "db-EPM2OP45Q75SETIITLSS4NP2QY" -> (known after apply)
      ~ endpoint                        = "ai-answers-docdb-instance.czuu8ii2ypob.ca-central-1.docdb.amazonaws.com" -> (known after apply)
      ~ engine_version                  = "5.0.0" -> (known after apply)
      ~ id                              = "ai-answers-docdb-instance" -> (known after apply)
      + identifier_prefix               = (known after apply)
      ~ kms_key_id                      = "arn:aws:kms:ca-central-1:730335533085:key/e393e2aa-0ea4-4abb-aa52-6f54ce42e195" -> (known after apply)
      + performance_insights_kms_key_id = (known after apply)
      ~ port                            = 27017 -> (known after apply)
      ~ preferred_backup_window         = "03:55-04:25" -> (known after apply)
      ~ preferred_maintenance_window    = "tue:06:56-tue:07:26" -> (known after apply)
      ~ publicly_accessible             = false -> (known after apply)
      ~ storage_encrypted               = true -> (known after apply)
        tags                            = {
            "CostCentre" = "ai-answers-prod"
            "Terraform"  = "true"
        }
      ~ writer                          = true -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_ssm_parameter.docdb_uri will be updated in-place
  ~ resource "aws_ssm_parameter" "docdb_uri" {
        id              = "docdb_uri"
      + insecure_value  = (known after apply)
        name            = "docdb_uri"
        tags            = {}
      ~ value           = (sensitive value)
      ~ version         = 1 -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ aws_docdb_cluster_arn       = "arn:aws:rds:ca-central-1:730335533085:cluster:ai-answers-docdb-cluster" -> (known after apply)
  ~ aws_docdb_cluster_id        = "ai-answers-docdb-cluster" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssm_parameter.docdb_uri"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
